{"OwnerPage" : {
	"firstHeader" : "How I got Started", 
	"firstP1" : "My name is Jon.  After graduating college with a Business/Marketing degree I decided to go into Finance.  After a little over seven years working for excel I decided I needed to shift gears and try a career in Software Development.  It seems clear that, like most people, I did not know what I wanted.  It might seem like an odd transition, but in retrospect I think finance was the perfect segway into programming.",
	"secondP1" : "During my financial incarceration I found the thing I enjoyed the most process automation.  Many people dont realize that Excel has incorporated a great VBA api.  This provides a great learning tool to understand the basic programming constructs.  My roles allowed me to take this a step further and teach programmatic classes and work with external APIs.  This served to highlight one tragic flaw; I did not love my career.",
	"thirdP1" : "Like various elements of this website I pulled myself up by my Bootstraps, and started studying new languages, and networking with many of the great members of Des Moines development community.  I currently work as a technical QA for an agronomic Corporation and use this as a opportunity to broaden my experience.",
	"secondHeader" : "What I am working on", 
	"firstP2" : "The Internet of Things (IOT) has brought about some amazingly big little revolutions.  The shrinking of technology both in terms of price paradoxically offset by increases in power have made programming more accessible and fun.  In my spare time I have played around with Raspberry Pi and used it to create a sump pump depth sensor and a garage door opener. ",
	"secondP2" : "I have also performed a social experiment of sorts.  When I first started learning a more object oriented language I decided to create a calculator app using a scripted approach.  Once I was more comfortable and confident with concepts such as Test Drive Development (TDD) and OOP I test drove another calculator to see how this fundamentally changed my architecture.",
	"thirdP2" : "At the moment I have been dabbling around in Web Development (this site) and played around with Java, Cucumber, and Selenide to generate Integration Tests.  I like to think of myself as a man of many interests.",
	"thirdHeader" : "What you Should know",
	"firstP3" : "I have varied interests.  I love design, drawing, reading, cooking, eating, carpentry, construction, travel, architechture, music, and I am up for just about anything."
	},
"Contact" : {
	"firstHeader" : "Contact Us",
	"firstP1Email" : "<a href='mailto:jongraf1@gmail.com?Subject=Soaring%20Leaf%20Solutions'>jongraf1@gmail.com</a>",
	"firstP1" : "Soaring Leaf Solutions, LLC",
	"secondP1" : "1469 NW 107th Street",
	"thirdP1" : "Clive, IA 50325",
	"fourthP1" : "309.269.8678"
	},
"History" : {
	"firstHeader" : "The Early Years",
	"firstP1" : "Central Iowa has a thriving developer community with a large number of great User Groups indicative of a growing market.  The most notable dimension is that the need for quality craftsman was clearly in high demand.  In 2015 Soaring Leaf Solutions was established as an initial foray into providing technical solutions to software agencies.",
	"secondHeader" : "The Middle Years",
	"firstP2" :"As with all ventures there are initial growing pains.  The acquisition of talent should always be of the highest priority with all companies if they want to remain relevant.  Our goal has remained to develop a broader understanding of technologies available and the ways in which they can be used to solve the evolving needs of our customers.",
	"thirdHeader" : "Heartofore known as Now",
	"firstP3" : "Currently, I am employed through the staffing and agile coaching agency Lean Techniques.  Working alongside such smart and engaging individuals has provided many opportunities to further self development and participate in community chartiy events.  Each day provides new opportunities to learn and I look forward to meeting each new challenge."
}
}